attached_assets/Pasted-zeki-MacBookAir-audio-streamer-curl-v-X-POST-H-Content-_1765447862921.txt

zeki@MacBookAir audio-streamer % curl -v -X POST \
  -H 'Content-Type: text/xml;charset="utf-8"' \
  -H 'SOAPAction: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"' \
  -d '<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><ObjectID>0</ObjectID><BrowseFlag>BrowseDirectChildren</BrowseFlag><Filter>*</Filter><StartingIndex>0</StartingIndex><RequestedCount>10</RequestedCount><SortCriteria></SortCriteria></u:Browse></s:Body></s:Envelope>' \
  "http://192.168.0.19:9791/88f1207c-ffc2-4070-940e-ca5af99aa4d3/upnp.org-ContentDirectory-1/control"
Note: Unnecessary use of -X or --request, POST is already inferred.
*   Trying 192.168.0.19:9791...
* Connected to 192.168.0.19 (192.168.0.19) port 9791
> POST /88f1207c-ffc2-4070-940e-ca5af99aa4d3/upnp.org-ContentDirectory-1/control HTTP/1.1
> Host: 192.168.0.19:9791
> User-Agent: curl/8.7.1
> Accept: */*
> Content-Type: text/xml;charset="utf-8"
> SOAPAction: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"
> Content-Length: 452
> 
* upload completely sent off: 452 bytes
< HTTP/1.1 200 OK
< Ext: 
< Content-Type: text/xml; charset="utf-8"
< SERVER: Posix/200809.0 UPnP/1.1 ohNet/1.0
< Transfer-Encoding: chunked
< Connection: close
< 
<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:BrowseResponse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><Result>&lt;DIDL-Lite xmlns=&quot;urn:schemas-upnp-org:metadata-1-0/DIDL-Lite/&quot; xmlns:dc=&quot;http://purl.org/dc/elements/1.1/&quot; xmlns:upnp=&quot;urn:schemas-upnp-org:metadata-1-0/upnp/&quot; xmlns:dlna=&quot;urn:schemas-dlna-org:metadata-1-0/&quot;&gt;
&lt;container id=&quot;0$albums&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;235 albums&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Dr_Dre-2001/01-01-Not_Applicable-Lolo-LLS.flac/$!picture-619-20466.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$items&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;3419 items&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Nils*20Frahm/All*20Melody/1/8-*232.flac/$!picture-1460-46139.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=Artist&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Artist&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_LRG&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/2Pac/Loyal*20to*20the*20Game/05*202Pac*20-*20Black*20Cotton.flac/$!picture-1510-395168.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=Date&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Date&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Piano*20Piano*20Piano*20-*202XHDFT1265/DSD*20512fs*20-*202ch/17.*20A*20Fine*20Romance*20DSD*20512fs*20-*202ch.dsf/$!picture-1726112061-143735.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=Genre&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Genre&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Adrianne*20Lenker/Bright*20Future/09*20-*20Adrianne*20Lenker*20-*20Already*20Lost.flac/$!picture-886-46268.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=All Artists&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;All Artists&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_LRG&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/2Pac/Loyal*20to*20the*20Game/05*202Pac*20-*20Black*20Cotton.flac/$!picture-1510-395168.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=Composer&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Composer&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_LRG&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Daft*20Punk/Discovery/01*20Daft*20Punk*20-*20One*20More*20Time.flac/$!picture-1469-267408.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$recentadd&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Recently Added&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_LRG&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Various*20Artists/Pure...*2080s*20Dance*20Party/09*20Fiction*20Factory*20-*20(Feels*20Like)*20Heaven.flac/$!picture-1252-105804.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$recentplay&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Recently Played&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Adrianne*20Lenker/Bright*20Future/09*20-*20Adrianne*20Lenker*20-*20Already*20Lost.flac/$!picture-886-46268.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container* Closing connection
&lt;/upnp:class&gt;&lt;/container&gt;&lt;container id=&quot;0$=#AudioData&quot; parentID=&quot;0&quot; restricted=&quot;1&quot; searchable=&quot;1&quot;&gt;&lt;dc:title&gt;Audio Data&lt;/dc:title&gt;&lt;upnp:albumArtURI dlna:profileID=&quot;JPEG_MED&quot;&gt;http://192.168.0.19:9790/minimserver/*/music/Piano*20Piano*20Piano*20-*202XHDFT1265/DSD*20512fs*20-*202ch/17.*20A*20Fine*20Romance*20DSD*20512fs*20-*202ch.dsf/$!picture-1726112061-143735.jpg&lt;/upnp:albumArtURI&gt;&lt;upnp:class&gt;object.container&lt;/upnp:class&gt;&lt;/container&gt;&lt;/DIDL-Lite&gt;</Result><NumberReturned>10</NumberReturned><TotalMatches>13</TotalMatches><UpdateID>32</UpdateID></u:BrowseResponse></s:Body></s:Envelope>%     